calebhabesh/doorlink/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CONFIG_SMART_DOORBELL_PRODUCTION_APP is not set
# CONFIG_SMART_DOORBELL_WAKE_SLEEP_DIAGNOSTIC is not set
CONFIG_SMART_DOORBELL_SPEAKER_ATTENUATION_DB=6
CONFIG_SMART_DOORBELL_SPEAKER_RAMP_MS=25
CONFIG_SMART_DOORBELL_CAMERA_OVERLAP_ACK=y
CONFIG_SMART_DOORBELL_CAMERA_OVERLAP_ACK_ATTENUATION_DB=12
CONFIG_SMART_DOORBELL_CAMERA_OVERLAP_ACK_DURATION_MS=3000
CONFIG_SMART_DOORBELL_CAMERA_CONVERGENCE_FRAMES=0
CONFIG_SMART_DOORBELL_REPRESS_HOLD_TO_TALK_MS=1200
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y

# QXGA production-still candidate. A fixed 2 MiB receive buffer was required
# for validated 2048x1536 captures; QSXGA remains deferred.
# CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_AUTO is not set
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=2097152

# ESP32-S3-WROOM-1-N16R8 has 8MB octal PSRAM. Camera frame buffers need PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# FreeRTOS 1000Hz Tick Rate (better for audio streaming)
CONFIG_FREERTOS_HZ=1000

# Custom Partition Table Setup
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash Size and Mode (ESP32-S3-WROOM-1-N16R8 reports quad flash, octal PSRAM)
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
# CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Native USB console for this board; UART0 is not exposed for normal bring-up.
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set

# Speed up OV5640 SCCB I2C register initialization from 100kHz to 400kHz
CONFIG_SCCB_CLK_FREQ=400000
